In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("raw_data.csv")

In [3]:
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [4]:
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [5]:
df.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [6]:
df.drop_duplicates()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [7]:
df2 = df.copy()
df2["tax"] = df2["income"].apply(lambda x: "20%" if x >= 50000 else "10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
1    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [8]:
gender_map={"Male" : "M" , "Female" : "F" , "Unknown" : "U"}
df2["gender"] = df2["gender"].map(gender_map)

In [9]:
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [10]:
df2.assign(new_income = df2["income"]*1.1)

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  20%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%     63800.0

In [11]:
df.sort_values("income")

    id          name   age country   gender   income
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
3    3          Alex   NaN     USA  Unknown  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
1    1      John Doe  29.0     USA     Male  55000.0
0    1      John Doe  29.0     USA     Male  55000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
6    6           NaN  45.0   India   Female  73000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN

In [12]:
df2=df2.ffill()

In [13]:
df2.sort_index()

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith  29.0  Canada      F  62000.0  20%
3    3          Alex  29.0     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F  47000.0  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6        Li Wei  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0   India      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz  29.0  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA      M  58000.0  20%

In [14]:
df2=df2.reset_index(drop=True)

In [15]:
df2["Rank"]=df2["income"].rank(ascending=False , method="min")
df2

    id          name   age country gender   income  tax  Rank
0    1      John Doe  29.0     USA      M  55000.0  20%   6.0
1    1      John Doe  29.0     USA      M  55000.0  20%   6.0
2    2    Jane Smith  29.0  Canada      F  62000.0  20%   3.0
3    3          Alex  29.0     USA      U  47000.0  10%   9.0
4    4  Maria Garcia  34.0   Spain      F  47000.0  10%   9.0
5    5        Li Wei  27.0   China      M  51000.0  20%   8.0
6    6        Li Wei  45.0   India      F  73000.0  20%   1.0
7    7    Ahmed Khan  38.0   India      M  68000.0  20%   2.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%   3.0
9    9   Carlos Ruiz  29.0  Mexico      M  45000.0  10%  11.0
10  10   Emily Davis  31.0     USA      M  58000.0  20%   5.0

In [16]:
df2.columns

Index(['id', 'name', 'age', 'country', 'gender', 'income', 'tax', 'Rank'], dtype='object')

In [17]:
df2[['id', 'name', 'age', 'country', 'gender', 'income', 'Rank','tax']]

    id          name   age country gender   income  Rank  tax
0    1      John Doe  29.0     USA      M  55000.0   6.0  20%
1    1      John Doe  29.0     USA      M  55000.0   6.0  20%
2    2    Jane Smith  29.0  Canada      F  62000.0   3.0  20%
3    3          Alex  29.0     USA      U  47000.0   9.0  10%
4    4  Maria Garcia  34.0   Spain      F  47000.0   9.0  10%
5    5        Li Wei  27.0   China      M  51000.0   8.0  20%
6    6        Li Wei  45.0   India      F  73000.0   1.0  20%
7    7    Ahmed Khan  38.0   India      M  68000.0   2.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0   3.0  20%
9    9   Carlos Ruiz  29.0  Mexico      M  45000.0  11.0  10%
10  10   Emily Davis  31.0     USA      M  58000.0   5.0  20%

In [18]:
df=pd.read_csv("raw_data.csv")

In [19]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [20]:
df.columns

Index(['id', 'name', 'age', 'country', 'gender', 'income'], dtype='object')

In [21]:
df[['name', 'age', 'country', 'gender', 'income' , 'id']]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [ ]:
df2=df.copy()

new_col_order=[col for col in df2.columns if col !="id"] + ["id"]
df2[new_col_order]

In [24]:
df2=df.copy()

In [25]:
df2 =df2.drop_duplicates()

In [26]:
df2 = df2.fillna(0)

In [27]:
df2= df2.sort_values("income" , ascending=False)

In [28]:
df2 = df2.reset_index(drop=True)

In [29]:
df2

   id          name   age country   gender   income
0   6             0  45.0   India   Female  73000.0
1   7    Ahmed Khan  38.0       0     Male  68000.0
2   8    Rachel Lee  29.0     USA   Female  62000.0
3   2    Jane Smith   0.0  Canada   Female  62000.0
4  10   Emily Davis  31.0     USA        0  58000.0
5   1      John Doe  29.0     USA     Male  55000.0
6   5        Li Wei  27.0   China     Male  51000.0
7   3          Alex   0.0     USA  Unknown  47000.0
8   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
9   4  Maria Garcia  34.0   Spain   Female      0.0

In [30]:
df2.to_csv("sorted_data.csv")

In [32]:
melted_data= df2.melt(
    id_vars=["name","age","country"],
    value_vars=["gender","income"],
    var_name="better_specie",
    value_name="moneyy"
)

In [33]:
melted_data

            name   age country better_specie   moneyy
0              0  45.0   India        gender   Female
1     Ahmed Khan  38.0       0        gender     Male
2     Rachel Lee  29.0     USA        gender   Female
3     Jane Smith   0.0  Canada        gender   Female
4    Emily Davis  31.0     USA        gender        0
5       John Doe  29.0     USA        gender     Male
6         Li Wei  27.0   China        gender     Male
7           Alex   0.0     USA        gender  Unknown
8    Carlos Ruiz   0.0  Mexico        gender     Male
9   Maria Garcia  34.0   Spain        gender   Female
10             0  45.0   India        income  73000.0
11    Ahmed Khan  38.0       0        income  68000.0
12    Rachel Lee  29.0     USA        income  62000.0
13    Jane Smith   0.0  Canada        income  62000.0
14   Emily Davis  31.0     USA        income  58000.0
15      John Doe  29.0     USA        income  55000.0
16        Li Wei  27.0   China        income  51000.0
17          Alex   0.0     USA        income  47000.0
18   Carlos Ruiz   0.0  Mexico        income  45000.0
19  Maria Garcia  34.0   Spain        income      0.0

In [35]:
pivoted_data=melted_data.pivot(
    index=["name","age","country"],
    columns="better_specie",
    values="moneyy"
)

In [36]:
pivoted_data

better_specie               gender   income
name         age  country
0            45.0 India     Female  73000.0
Ahmed Khan   38.0 0           Male  68000.0
Alex         0.0  USA      Unknown  47000.0
Carlos Ruiz  0.0  Mexico      Male  45000.0
Emily Davis  31.0 USA            0  58000.0
Jane Smith   0.0  Canada    Female  62000.0
John Doe     29.0 USA         Male  55000.0
Li Wei       27.0 China       Male  51000.0
Maria Garcia 34.0 Spain     Female      0.0
Rachel Lee   29.0 USA       Female  62000.0

In [37]:
df=pd.read_csv("IRIS.csv")

In [38]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa
6           4.6          3.4           1.4          0.3  Iris-setosa
7           5.0          3.4           1.5          0.2  Iris-setosa
8           4.4          2.9           1.4          0.2  Iris-setosa
9           4.9          3.1           1.5          0.1  Iris-setosa

In [40]:
df.shape

(150, 5)

In [41]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [42]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [43]:
df.query("petal_length>4.5")

     sepal_length  sepal_width  petal_length  petal_width          species
50            7.0          3.2           4.7          1.4  Iris-versicolor
52            6.9          3.1           4.9          1.5  Iris-versicolor
54            6.5          2.8           4.6          1.5  Iris-versicolor
56            6.3          3.3           4.7          1.6  Iris-versicolor
58            6.6          2.9           4.6          1.3  Iris-versicolor
..            ...          ...           ...          ...              ...
145           6.7          3.0           5.2          2.3   Iris-virginica
146           6.3          2.5           5.0          1.9   Iris-virginica
147           6.5          3.0           5.2          2.0   Iris-virginica
148           6.2          3.4           5.4          2.3   Iris-virginica
149           5.9          3.0           5.1          1.8   Iris-virginica

[63 rows x 5 columns]

In [48]:
my_specie="Iris-virginica"
df.query("petal_length>4.5 and species == @my_specie")

     sepal_length  sepal_width  petal_length  petal_width         species
100           6.3          3.3           6.0          2.5  Iris-virginica
101           5.8          2.7           5.1          1.9  Iris-virginica
102           7.1          3.0           5.9          2.1  Iris-virginica
103           6.3          2.9           5.6          1.8  Iris-virginica
104           6.5          3.0           5.8          2.2  Iris-virginica
105           7.6          3.0           6.6          2.1  Iris-virginica
107           7.3          2.9           6.3          1.8  Iris-virginica
108           6.7          2.5           5.8          1.8  Iris-virginica
109           7.2          3.6           6.1          2.5  Iris-virginica
110           6.5          3.2           5.1          2.0  Iris-virginica
111           6.4          2.7           5.3          1.9  Iris-virginica
112           6.8          3.0           5.5          2.1  Iris-virginica
113           5.7          2.5           5.0          2.0  Iris-virginica
114           5.8          2.8           5.1          2.4  Iris-virginica
115           6.4          3.2           5.3          2.3  Iris-virginica
116           6.5          3.0           5.5          1.8  Iris-virginica
117           7.7          3.8           6.7          2.2  Iris-virginica
118           7.7          2.6           6.9          2.3  Iris-virginica
119           6.0          2.2           5.0          1.5  Iris-virginica
120           6.9          3.2           5.7          2.3  Iris-virginica
121           5.6          2.8           4.9          2.0  Iris-virginica
122           7.7          2.8           6.7          2.0  Iris-virginica
123           6.3          2.7           4.9          1.8  Iris-virginica
124           6.7          3.3           5.7          2.1  Iris-virginica
125           7.2          3.2           6.0          1.8  Iris-virginica
126           6.2          2.8           4.8          1.8  Iris-virginica
127           6.1          3.0           4.9          1.8  Iris-virginica
128           6.4          2.8           5.6          2.1  Iris-virginica
129           7.2          3.0           5.8          1.6  Iris-virginica
130           7.4          2.8           6.1          1.9  Iris-virginica
131           7.9          3.8           6.4          2.0  Iris-virginica
132           6.4          2.8           5.6          2.2  Iris-virginica
133           6.3          2.8           5.1          1.5  Iris-virginica
134           6.1          2.6           5.6          1.4  Iris-virginica
135           7.7          3.0           6.1          2.3  Iris-virginica
136           6.3          3.4           5.6          2.4  Iris-virginica
137           6.4          3.1           5.5          1.8  Iris-virginica
138           6.0          3.0           4.8          1.8  Iris-virginica
139           6.9          3.1           5.4          2.1  Iris-virginica
140           6.7          3.1           5.6          2.4  Iris-virginica
141           6.9          3.1           5.1          2.3  Iris-virginica
142           5.8          2.7           5.1          1.9  Iris-virginica
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [55]:
df.groupby("species")["sepal_length"].mean()

species
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: sepal_length, dtype: float64

In [51]:
df.groupby()

In [52]:
df2["species"]

In [56]:
df.groupby("species")["petal_width"].max()

species
Iris-setosa        0.6
Iris-versicolor    1.8
Iris-virginica     2.5
Name: petal_width, dtype: float64

In [57]:
df.groupby("species")["sepal_width"].std()

species
Iris-setosa        0.381024
Iris-versicolor    0.313798
Iris-virginica     0.322497
Name: sepal_width, dtype: float64

In [58]:
df["petal_ratio"]=df["petal_length"]/df["petal_width"]

In [59]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,petal_ratio
0,5.1,3.5,1.4,0.2,Iris-setosa,7.000000
1,4.9,3.0,1.4,0.2,Iris-setosa,7.000000
2,4.7,3.2,1.3,0.2,Iris-setosa,6.500000
3,4.6,3.1,1.5,0.2,Iris-setosa,7.500000
4,5.0,3.6,1.4,0.2,Iris-setosa,7.000000
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,2.260870
146,6.3,2.5,5.0,1.9,Iris-virginica,2.631579
147,6.5,3.0,5.2,2.0,Iris-virginica,2.600000
148,6.2,3.4,5.4,2.3,Iris-virginica,2.347826
149,5.9,3.0,5.1,1.8,Iris-virginica,2.833333

In [60]:
df.groupby("species")["petal_ratio"].mean()

species
Iris-setosa        7.078000
Iris-versicolor    3.242837
Iris-virginica     2.780662
Name: petal_ratio, dtype: float64

In [61]:
df=pd.read_csv("Titanic-Dataset.csv")

In [62]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [67]:
sex="female"
df.query("Sex==@sex and Fare>30")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [73]:
df.groupby("Pclass")["Survived"].count() / df["Survived"].count() * 100

Pclass
1    24.242424
2    20.650954
3    55.106622
Name: Survived, dtype: float64

In [74]:
df.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [75]:
df.groupby("Pclass")["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64